1、论文写作事实汇总
（1）paper structure（论文结构）
    拿到一篇论文，一般来说从头到尾主要是是题目（title）、摘要（abstract）、引言/文献综述（introduction/literature review）、研究方法（method）、
    结果/讨论（result/discussion）、结论（conclusion）、参考文献（reference）这七部分，但在完成一篇论文的时候，往往并不是按照这个顺序进行。最先开
    始应该是研究方法，根据研究方法进行实验并得出实验结果，对实验结果进行讨论得到了一个新的结论，再通过相关调研了解目前最新的相关消息，在这整个过程中
    都需要进行参考文献的调研和学习，最后再完成自己的论文之前，给自己的论文写一个简明扼要的摘要，并起一个能够概括全文的名字，这时一篇论文就已经完成了。
（2）review process（评审过程）
    论文作者在完成论文并投稿后，会由管理员（Admin）进行论文的录入并进行Author’s Guideline检查，管理员具有直接拒绝的权力。管理员审核通过后，论文会交
    到主编（EIC: Editor in Chief）手上进行查重，查重通过后主编会指派责编（AE: Associate Editor）进行下一步的审核。责编初审后如果没有发现问题，就寻
    找3-5个reviewers进行最终的评审，reviewer会根据论文的原创性、重要性、科学性、准确性、文章表达以及其他细节等方面进行打分并给出一定的评语，之后会统
    一交给责编，由责编进行总结，并给出修改意见。这里要注意的是只要不是拒绝都是好消息。对于给出的评审意见需要进行逐一的修改和回复，并在修改后的论文里进
    行明确的标注。完成修改后会交给主编进行最后的润色以及版权移交等事宜。如果进行到这一步，那恭喜你完成了一篇优秀的论文。
（3）文章的第一印象（主观）
    审稿人拿到一篇论文后，他（她）的各种评价不可避免的会收到第一印象的影响，主要是体现在图片表格、参考文献这两个部分。图片和表格这两部分要说的东西比较
    多，在后面会单独列出来，这里主要说一下参考文献的注意事项。参考文献有两个要注意的地方：
        ①文献的数量要满足一定的比例，对于一篇正文有8页左右的论文，参考文献的数量至少得保证在20篇以上；
        ②参考文献的时间要新，以最近3-5年内的文献为主，过老的文献会让人觉得没有经过深度的调研。

2、引言（introduction）
    对于一篇论文而言，introduction是读者接收到的第一信息，就像一份PPT的前几页一样，起到吸引读者的作用。一篇好的论文在introduction部分应注意回答两个
    问题：（1）论文的研究主题是什么？（2）写作这篇论文的动机（motivation）是什么？其中第一点应该直接说出这篇论文的贡献（contribution），第二点应该是
    对第一点的合理解释（从重要性和该领域存在一定的空白两个方面出发），二者之间应该建立一个合理的逻辑体系来引导读者。Introduction部分应主要包括背景、
    文献和课题陈述三部分，背景和文献是motivation的来源，背景也指出了论文所做研究的重要性。一些小的点总结如下：
        ①应通过最新的近期文献建立合理的逻辑观；
        ②可以适当加入好看的图片
        ③Introduction的篇幅应占整个论文的10%左右
   
3、研究方法（methodology）
   研究方法部分的主旨是向读者解释说明作者是如何得到结果的，说明文章的contribution。对于理论类的文章，应注意相关的推导过程；对于实证类的文章，应注意
   调查方法、数据处理；对于工程应用类的文章，则应注意理论与实践的结合。作者应该在这部分提供足够准确的技术细节，如假设、数学推导、验证、实验设备介绍等，
   这里有个隐含的要求就是读者可以通过作者说明的研究方法在条件允许的情况下照猫画虎重现论文中的结果，无论是数学模型、模拟结果还是实验结果。研究的过程可
   能是曲折的，但是在这里展示的应该是从开始到完成结果最直接的过程。
   在这部分的写作过程中我们应当遵循一定的写作体系，按照写作规范进行。
（1）符号的命名应具有一致性，即相同的符号在同一篇论文中应该有相同的含义，同时在符号第一次出现的时候应该进行相应的描述（description）；
（2）公式的编号要在写作的过程中及时进行全文的更新；
（3）研究方法这部分的内容应该全部为干货，不应灌水，不要写无关的内容（没联系的公式、背景等）与过于基础的内容，所有的内容应围绕主题进行。
      
4、结果与讨论（result & discussion）
   结果与讨论是一篇论文的核心，直接体现了作者的学术水平。从一位学术小白到学术大牛，认真的科研、广泛的阅读、专业的写作、科学的训练等都是必不可少的，
   这是一条没有捷径的“大牛之路”。对于萌新来说，可以按照模板进行入门的训练直至有了自己的一个讨论习惯。一般可按照结果+讨论的模式进行，按照详略得当的
   原则，主要可以分为三个步骤：
（1）描述实验结果，视觉上采用图表的形式描述，语言方面则是通过直截了当的语言（可从定量和定性两个方面依次进行）；
（2）分析实验结果，这一部分主要是采用论证和对比的方法进行，尽可能多的与最新最火的论文进行对比分析；
（3）最后对实验结果进行意义、展望和猜想等方面的讨论，这里要注意的是学会“自圆其说”，实事求是地用结果得出结论。

5、图和表（figure and table）
    论文写作过程中这部分的注意事项总结如下：
（1）根据论文评审中的Author’s Guide的模板，图片的标注一般放在图片的下方，用阿拉伯数字进行编号（Fig.1 / Fig.2 / Fig.3 / …），表格的标注一般放
在表格的上方，用罗马字母进行编号（Table I. / Table II. / Table III. / …）；
（2）所有的图和表都必须能够在文中找到并且有对应的说明；
（3）在文中引用图和表时，标号的形式必须与原图标保持一致（如：According to Fig.5, …/ Table VI indicates that …）；
（4）图表中符号应该与文中符号具有一致性，包括符号的形式和符号的单位；
（5）对于图表的标题（caption）应该要清晰、准确、完整，应该能够对图标做一个简单的说明；
（6）要学会用颜色和图例区分多组数据，对于不好的数据也要进行同样的展示，不要试图隐藏不好的结果；
（7）一组图表里可能会有多组图和表，这时候要使用副标题分别进行说明；
（8）杜绝一图多投，同时也杜绝一稿多投，不要给未来的自己找麻烦；
（9）对于做实验过程中得到的图表信息要进行保留，珍惜原始数据。

6、结论、摘要与题目（conclusion、abstract and title）
    结论是一篇论文结束的标志，是对结果和讨论的总结，在英文文章中，通常这样开始：“This paper investigate (Topic) using (Method) …”。这部分在写作
    时要注意不要重复结果部分的内容，而是对其的汇总，更不能直接进行复制粘贴，要进行一定的修改，可以采用同义词转换等手法。同时在结论部分应该强调文章的
    贡献（contribution），并且要与引言（introduction）部分相对应。
    摘要与题目是一篇论文被搜索后会率先出现在搜索引擎中的内容，是带给读者的第一印象，因此这部分的内容应该直截了当，拒绝文不对题。对于摘要，应该从引言、
    研究方法、结果与讨论、结论等部分摘取要点，说明文章的工作内容，突出文章的贡献和重要性；而对于题目，应该要包含所有的关键词，包括研究内容（Topic）、
    研究方法（Method）和结果（Result）等，这里要注意结果采用隐含的方式进行描述（improve or reduce）

7、其他
    最后一节课的笔记这里没有整理，是视频up主的一些总结，感兴趣的同学可以去看看[https://space.bilibili.com/230105574/channel/detail?cid=45741]
